にちゃんねる(簡易版)/2ch/app/controllers/boards_controller.rb

INSERT INTO "boards" ("title", "editor", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "トイレの仕方"], ["editor", "そうき"], ["created_at", "2023-08-02 12:14:13.339176"], ["updated_at", "2023-08-02 12:14:13.339176"]]
---
  def create
    @board = Board.new(params_board)
    if @board.save

SELECT "boards".* FROM "boards" WHERE "boards"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "boards" WHERE "boards"."id" = $1  [["id", 1]]
---
  def destroy
    @board = Board.find(params[:id])
    @board.destroy

SELECT "boards".* FROM "boards" WHERE "boards"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @board = Board.find(params[:id])

SELECT "boards".* FROM "boards" WHERE "boards"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "boards" SET "title" = $1, "editor" = $2, "updated_at" = $3 WHERE "boards"."id" = $4  [["title", "の食べ方"], ["editor", "a"], ["updated_at", "2023-08-02 12:39:59.743782"], ["id", 1]]
---
  def update
    @board = Board.find(params[:id])
    if @board.update(params_board)